Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/diff-omegat.tmx
Source language: en_us
Languages: pt_br

source: Merge Visualizers
pt_br: Mesclar visualizadores

source: Graphical Merge Conflicts Resolver
pt_br: Resolvedor de conflitos de mesclagem gráfico

source: Color of Text of Unresolved Conflict
pt_br: Cor do texto de conflito não resolvido

source: The background color of text of unresolved conflict.
pt_br: A cor de plano de fundo do texto de conflito não resolvido.

source: Color of Text Applied To Resolve Conflict
pt_br: Cor do texto aplicado para resolver conflito

source: The background color of text applied to resolve the conflict
pt_br: Cor de plano de fundo do texto aplicado para resolver o conflito

source: Color of Text Not Applied To Resolve Conflict
pt_br: Cor do texto não aplicado à resolução de conflito

source: The background color of text not applied to resolve the conflict
pt_br: A cor de plano de fundo do texto que não se aplica na resolução do conflito

source: Merge Conflicts Resolver
pt_br: Mesclar resolvedor de conflitos

source: Conflict Resolver Component
pt_br: Componente resolvedor de conflitos

source: Graphical resolver of merge conflicts.
pt_br: Resolvedor gráfico de conflitos de mesclagem

source: Files With Conflicts
pt_br: Arquivos com conflitos

source: Tabs of files with conflicts.
pt_br: Abas de arquivos com conflitos

source: &Next Difference
pt_br: Próxima difere&nça

source: &Previous Difference
pt_br: Diferença &anterior

source: Conflict: {0} of {1}, Unresolved: {2}
pt_br: Conflito: {0} de {1}, Não resolvido(s): {2}

source: The First File
pt_br: O primeiro arquivo

source: The content of the first file.
pt_br: O conteúdo do primeiro arquivo.

source: The Second File
pt_br: O segundo arquivo

source: The content of the second file.
pt_br: O conteúdo do segundo arquivo.

source: The Result of Merge
pt_br: O resultado da mesclagem

source: The content of the result of the merge and resolved conflicts.
pt_br: O conteúdo do resultado dos conflitos resolvidos e de mesclagem

source: &Accept
pt_br: &Aceitar

source: Acc&ept & Next
pt_br: Ac&eitar & próximo

source: Accep&t
pt_br: Acei&tar

source: Accept & Ne&xt
pt_br: Aceitar & pró&ximo

source: Accept the left option.
pt_br: Aceitar a opção da esquerda.

source: Accept the left option and go to the next conflict.
pt_br: Aceitar a opção da esquerda e ir para o próximo conflito.

source: Accept the right option.
pt_br: Aceitar a opção da direita.

source: Accept the right option and go to the next conflict.
pt_br: Aceitar a opção da direita e ir para o próximo conflito.

source: File {0} is modified.
pt_br: O arquivo {0} está modificado.

source: Save it?
pt_br: Salvar arquivo?

source: {0} files are modified.
pt_br: {0} arquivos estão modificados.

source: Save them?
pt_br: Salvar arquivos?

source: Failed to save the merge result: {0}
pt_br: Falha ao salvar os resultados da mesclagem: {0}

source: Accept changes and close dialog.
pt_br: Aceitar alterações e fechar caixa de diálogo.

source: &Cancel
pt_br: &Cancelar

source: Cancel changes and close dialog.
pt_br: Cancelar alterações e fechar caixa de diálogo.

source: &Help
pt_br: Aj&uda

source: Show help for this dialog.
pt_br: Exibir ajuda para esta caixa de diálogo.

source: Close
pt_br: Fechar

source: File {0} is modified, save it?
pt_br: Arquivo {0} está modificado, salvar arquivo?

source: Not all conflicts in all files have been resolved.
pt_br: Nem todos os conflitos em todos os arquivos foram resolvidos.

source: {0} files are modified, save them?
pt_br: {0} arquivos estão modificados, salvar arquivos?

source: Conflicts are not resolved.
pt_br: Conflitos não estão esolvidos.

source: Close vizualizer anyway?
pt_br: Fechar visualizador assim mesmo?

source: Diff
pt_br: Comparação

source: Tools
pt_br: Ferramentas

source: Provides the diff action to view file differences.
pt_br: Fornece a ação de comparação para visualizar diferenças em arquivos.

source: The Diff module provides an action, that is enabled when two files are selected in the IDE.
pt_br: O módulo de Comparação fornece uma ação, a qual é ativada quando dois arquivos são selecionados no IDE.

source: It is based on an external diff utility, that is executed to obtain the differences, which are then shown to the user graphically.
pt_br: Isto é baseado num utilitário de comparação externo que é executado para obter as diferenças que serão exibidas graficamente para o usuário.

source: Diff Services
pt_br: Serviços de Comparação

source: Diff Engines
pt_br: Mecanismos de comparação

source: Diff Visualizers
pt_br: Visualizadores de comparação

source: Diff and Merge Types
pt_br: Tipos de Comparação e de Mesclagem

source: Di&ff
pt_br: Co&mparar

source: Diffing...
pt_br: Comparando...

source: Appl&y Diff Patch...
pt_br: Apl&icar correção de comparação

source: Parsing of the patch file failed: {0}
pt_br: Análise do arquivo de correção falhou: {0}

source: Select The Diff Patch For {0}
pt_br: Selecione o arquivo de correção de comparação para {0}

source: Select The Diff Patch For Files In {0}
pt_br: Selecione o arquivo de correção de comparação para os arquivos em {0}

source: Patch
pt_br: Correção

source: P
pt_br: S

source: Select the diff patch file to apply.
pt_br: Selecione o arquivo de correção de comparação à ser aplicado.

source: No differences found in file {0}.
pt_br: Nenhuma diferença encontrada no arquivo {0}.

source: Application of the patch to ''{1}'' failed: {0}
pt_br: Aplicação do arquivo de correção para "{1}" falhou: {0}

source: The patch application failed, it's not possible to write to {0}.
pt_br: A aplicação do arquivo de correção falhou, não é possível escrever em {0}.

source: Following files are to be patched, but not found: {0}
pt_br: O arquivo de correção deveria ser aplicado nos seguintes arquivos, mas não foram encontrados: {0}

source: The patch cannot be applied in the selected context.
pt_br: O arquivo de correção não pode ser aplicado no contexto selecionado.

source: It was originally generated relative to "{0}".
pt_br: Isto foi originalmente gerado relativo a "{0}".

source: Patch applied successfully.
pt_br: Arquivo de correção aplicado com sucesso.

source: View applied changes?
pt_br: Visualizar alterações aplicadas?

source: (patched binary files will not be displayed)
pt_br: (Arquivos binários com arquivo de correção aplicado não seram exibidos.)

source: Patch applied partially.
pt_br: Arquivo de correção aplicado parcialmente.

source: The following backup copies cannot be removed after successful application of a patch:
pt_br: Estas cópias de backup não poderão ser removidas após a completa aplicação do arquivo de correção.

source: {0} Reason(s):
pt_br: {0} motivo(s):

source: No differences were found between {0} and {1}.
pt_br: Nenhuma diferença foi encontrada entre {0} e {1}.

source: Diff failed for {0} and {1}.
pt_br: A comparação falhou para {0} e {1}.

source: No Diff Visualizer is registered in the system.
pt_br: Nenhum visualizador de comparação está registrado no sistema.

source: No Diff Engine is registered in the system.
pt_br: Nenhum mecanismo de comparação está registrado no sistema.

source: This dialog allows you to choose patch
pt_br: Esta caixa de diálogo permite você escolher o arquivo de correção.

source: Patch Files (*.diff, *.patch)
pt_br: Arquivos de correção (*.diff, *.patch)

source: Command-line Diff
pt_br: Linha de comando de comparação

source: An external diff engine that produces a list of differences in a format compatible with the UNIX diff command.
pt_br: Um mecanismo externo de comparação que produz uma lista de diferenças em um formato compatível com o comando diff do UNIX

source: The diff command ''{0}'' failed to execute in the system.
pt_br: O comando de comparação ''{0}'' falhou ao executar no sistema.

source: The Diff Command
pt_br: O comando de comparação

source: The command executed by the external diff engine.
pt_br: O comando executado pelo mecanismo de comparação externo.

source: Built-in Diff Service
pt_br: Serviço de comparação embutido

source: No differences were found between ''{0}'' and ''{1}''.
pt_br: Nenhuma diferença foi encontrada entre ''{0}'' e ''{1}''.

source: There are no diff engines registered in the system
pt_br: Não existem mecanismos de comparação registrados no sistema.

source: There are no diff visualizers registered in the system
pt_br: Não existem visualizadores de comparação registrados no sistema

source: &Engine:
pt_br: &Mecanismo:

source: &Visualizer:
pt_br: &Visualizador:

source: Computing differences:
pt_br: Computando diferenças:

source: Computing Differences...
pt_br: Computando diferenças...

source: Engine.
pt_br: Mecanismo

source: Engine Property Panel
pt_br: Painel de propriedades do mecanismo

source: Choose diff engine.
pt_br: Escolha o mecanismo de comparação.

source: Visualizer.
pt_br: Visualizador.

source: Visualizer Property Panel
pt_br: Painel de propriedades do visualizador

source: Choose diff visualizer.
pt_br: Escolha o visualizador de comparação

source: Diff Component
pt_br: Componente de comparação

source: Differences between source files
pt_br: Diferenças entre arquivos de códigos-fonte

source: Show Diff Service Selector
pt_br: Exibir seletor de serviço de comparação

source: Show panel with engine and visualizer selectors.
pt_br: Exibir painel com seletores de mecanismos e visualizadores.

source: Diff: {0}
pt_br: Comparação: {0}

source: Next Difference
pt_br: Próxima diferença

source: Previous Difference
pt_br: Diferença anterior

source: {0} <-> {1} [Diff]
pt_br: {0} <-> {1} [Comparação]

source: Diff Panel
pt_br: Painel de comparação

source: Diff panel.
pt_br: Painel de comparação.

source: Graphical Diff Viewer
pt_br: Visualizador gráfico de comparação

source: Graphical color viewer of differences between two sources.
pt_br: Visualizador gráfico colorido das diferenças entre dois códigos-fonte.

source: Line Numbers Component
pt_br: Componente para número de linhas

source: Component for displaying line numbers and annotations.
pt_br: Componente para exibir o número das linhas e anotações.

source: Color of Added Text
pt_br: Cor do texto adicionado

source: The background color of added text.
pt_br: Cor do plano de fundo do texto adicionado.

source: Color of Removed Text
pt_br: Cor do texto removido.

source: The background color of removed text.
pt_br: A cor do plano de fundo do texto removido.

source: Color of Changed Text
pt_br: Cor do texto alterado

source: The background color of changed text.
pt_br: A cor do plano de fundo do texto alterado.

source: Context Mode
pt_br: Modo do contexto

source: Number Of Context Lines
pt_br: Número das linhas do contexto

source: Textual Diff Viewer
pt_br: Visualizador textual de comparaçào

source: Differences between two sources in plain text.
pt_br: Diferenças entre dois códigos-fontes em texto simples.

source: Modern Diff Viewer
pt_br: Visualizador moderno de comparação

source: Displays Diff of two files in a compact form
pt_br: Exibir comparação de dois arquivos de uma forma compacta

source: <no title>
pt_br: <Sem título>

source: <Content Not Available>
pt_br: <Conteúdo não disponível>

source: <Binary File>
pt_br: <Arquivo binário>

source: Remove
pt_br: Remover

source: Replace
pt_br: Substituir

source: Insert
pt_br: Inserir

source: Move All
pt_br: Mover todos

source: Built-in Diff Engine
pt_br: Mecanismo de comparação embutido

source: Default built-in diff engine that computes differences between two sources.
pt_br: Mecanismo de comparação embutido padrão que verifca as diferenças entre dois códigos-fonte.

source: Ignore Whitespaces
pt_br: Ignorar espaços em branco

source: If true then starting and trailing line whitespaces are ignored.
pt_br: Caso selecionado os espaços em branco no início e no final serão ignorados.

source: Diff Options
pt_br: Opções de comparação

source: &Internal Diff
pt_br: Comparação &interna

source: &External Diff
pt_br: Comparação &externa

source: Ig&nore Whitespaces
pt_br: Ig&norar Espaços em Branco

source: &Command:
pt_br: &Comando:

source: Bro&wse...
pt_br: Pro&curar...

source: Graphical Diff Viewer:
pt_br: Visualizador gráfico de comparação:

source: Lets you choose a Diff executable
pt_br: Permite você escolher um executável de comparação

source: Browse For Diff Executable
pt_br: Procurar por executável de comparação

source: External diff command you have entered seems to be invalid.
pt_br: O comando de comparaçào externa que você digitou parece estar inválido.

source: Diff functionality may be limited.
pt_br: Funcionalidade de comparação pode ser limitada.

source: &Diff
pt_br: &Comparar

source: Categories
pt_br: Categorias

source: Foreground Chooser
pt_br: Seletor de primeiro plano

source: Background Chooser
pt_br: Seletor de segundo plano

source: Ca&tegory:
pt_br: Ca&tegoria:

source: Fo&reground:
pt_br: Primei&ro Plano:

source: &Background:
pt_br: Segundo &plano:

source: Custom ...
pt_br: Personalizar ...

source: Black
pt_br: Preto

source: Blue
pt_br: Azul

source: Cyan
pt_br: Azul-claro

source: Dark Gray
pt_br: Cinza escuro

source: Gray
pt_br: Cinza

source: Green
pt_br: Verde

source: Light Gray
pt_br: Cinza claro

source: Magenta
pt_br: Violeta

source: Orange
pt_br: Laranja

source: Pink
pt_br: Rosa

source: Red
pt_br: Vermelho

source: White
pt_br: Branco

source: Yellow
pt_br: Amarelo

source: Select Color
pt_br: Selecionar cor

source: &Highlighting:
pt_br: Rea&lce:
